test/mocha/server/service/data/oca/expected-soap-envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.linc" xmlns:x-="http://xml.apache.org/xml-soap"><soapenv:Header/><soapenv:Body><ws:SBA_LINC><ws:SBA_LINC><x-:item><x-:key>username</x-:key><x-:value>user1</x-:value></x-:item><x-:item><x-:key>password</x-:key><x-:value>password1</x-:value></x-:item><x-:item><x-:key>SBA_LINC</x-:key><x-:value><![CDATA[<SomeXml/>]]></x-:value></x-:item></ws:SBA_LINC></ws:SBA_LINC></soapenv:Body></soapenv:Envelope>
