test/mocha/server/service/data/oca/expected-password-update-soap-envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.linc" xmlns:x-="http://xml.apache.org/xml-soap"><soapenv:Header/><soapenv:Body><ws:PasswordUpdate><ws:Inputs><x-:item><x-:key>Username</x-:key><x-:value>Username_1</x-:value></x-:item><x-:item><x-:key>Password</x-:key><x-:value>Password_1</x-:value></x-:item><x-:item><x-:key>NewPassword</x-:key><x-:value>NewPassword_1</x-:value></x-:item></ws:Inputs></ws:PasswordUpdate></soapenv:Body></soapenv:Envelope>